# GetLayerEnableCutPl

## Description
Gets whether the cut plane of the layer is enabled.

```pascal
FUNCTION GetLayerEnableCutPl(layer : HANDLE) : BOOLEAN;
```

```python

def vs.GetLayerEnableCutPl(layer):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|layer|HANDLE|The layer.|

## Returns
Whether the cut plane of the layer is enabled.

## See Also
VS Functions:
SetLayerEnableCutPl

## Version
Availability: from Vectorworks 2017
## Category
* Layers